Revit 2026 API

# PrimarySizeCriterion Methods

---

The PrimarySizeCriterion type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | All | Creates a criterion with a range of all sizes. |
|  | Dispose | (Inherited from RoutingCriterionBase) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Verify if two criteria are the same. (Inherited from RoutingCriterionBase) |
|  | None | Creates a criterion with a range of no sizes. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

PrimarySizeCriterion Class

Autodesk.Revit.DB Namespace